Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEray_reg.h
/** \brief 11C, Offset Correction Value */
#define ERAY1_OCV /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OCV*)0xF001711Cu)

/** \brief 120, SYNC Frame Status */
#define ERAY1_SFS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SFS*)0xF0017120u)

/** \brief 124, Symbol Window and Network Idle Time Status */
#define ERAY1_SWNIT /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SWNIT*)0xF0017124u)

/** \brief 128, Aggregated Channel Status */
#define ERAY1_ACS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ACS*)0xF0017128u)

/** \brief 130, Even Sync ID Symbol Window 1 */
#define ERAY1_ESID_1S0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017130u)
/** Alias (User Manual Name) for ERAY1_ESID_1S0.
* To use register names with standard convension, please use ERAY1_ESID_1S0.
*/
#define ERAY1_ESID01 (ERAY1_ESID_1S0)

/** \brief 134, Even Sync ID Symbol Window 2 */
#define ERAY1_ESID_1S1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017134u)
/** Alias (User Manual Name) for ERAY1_ESID_1S1.
* To use register names with standard convension, please use ERAY1_ESID_1S1.
*/
#define ERAY1_ESID02 (ERAY1_ESID_1S1)

/** \brief 138, Even Sync ID Symbol Window 3 */
#define ERAY1_ESID_1S2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017138u)
/** Alias (User Manual Name) for ERAY1_ESID_1S2.
* To use register names with standard convension, please use ERAY1_ESID_1S2.
*/
#define ERAY1_ESID03 (ERAY1_ESID_1S2)

/** \brief 13C, Even Sync ID Symbol Window 4 */
#define ERAY1_ESID_1S3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001713Cu)
/** Alias (User Manual Name) for ERAY1_ESID_1S3.
* To use register names with standard convension, please use ERAY1_ESID_1S3.
*/
#define ERAY1_ESID04 (ERAY1_ESID_1S3)

/** \brief 140, Even Sync ID Symbol Window 5 */
#define ERAY1_ESID_1S4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017140u)
/** Alias (User Manual Name) for ERAY1_ESID_1S4.
* To use register names with standard convension, please use ERAY1_ESID_1S4.
*/
#define ERAY1_ESID05 (ERAY1_ESID_1S4)

/** \brief 144, Even Sync ID Symbol Window 6 */
#define ERAY1_ESID_1S5 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017144u)
/** Alias (User Manual Name) for ERAY1_ESID_1S5.
* To use register names with standard convension, please use ERAY1_ESID_1S5.
*/
#define ERAY1_ESID06 (ERAY1_ESID_1S5)

/** \brief 148, Even Sync ID Symbol Window 7 */
#define ERAY1_ESID_1S6 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017148u)
/** Alias (User Manual Name) for ERAY1_ESID_1S6.
* To use register names with standard convension, please use ERAY1_ESID_1S6.
*/
#define ERAY1_ESID07 (ERAY1_ESID_1S6)

/** \brief 14C, Even Sync ID Symbol Window 8 */
#define ERAY1_ESID_1S7 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001714Cu)
/** Alias (User Manual Name) for ERAY1_ESID_1S7.
* To use register names with standard convension, please use ERAY1_ESID_1S7.
*/
#define ERAY1_ESID08 (ERAY1_ESID_1S7)

/** \brief 150, Even Sync ID Symbol Window 9 */
#define ERAY1_ESID_1S8 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017150u)
/** Alias (User Manual Name) for ERAY1_ESID_1S8.
* To use register names with standard convension, please use ERAY1_ESID_1S8.
*/
#define ERAY1_ESID09 (ERAY1_ESID_1S8)

/** \brief 154, Even Sync ID Symbol Window 10 */
#define ERAY1_ESID_1S9 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017154u)
/** Alias (User Manual Name) for ERAY1_ESID_1S9.
* To use register names with standard convension, please use ERAY1_ESID_1S9.
*/
#define ERAY1_ESID10 (ERAY1_ESID_1S9)

/** \brief 158, Even Sync ID Symbol Window 11 */
#define ERAY1_ESID_1S10 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017158u)
/** Alias (User Manual Name) for ERAY1_ESID_1S10.
* To use register names with standard convension, please use ERAY1_ESID_1S10.
*/
#define ERAY1_ESID11 (ERAY1_ESID_1S10)

/** \brief 15C, Even Sync ID Symbol Window 12 */
#define ERAY1_ESID_1S11 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF001715Cu)
/** Alias (User Manual Name) for ERAY1_ESID_1S11.
* To use register names with standard convension, please use ERAY1_ESID_1S11.
*/
#define ERAY1_ESID12 (ERAY1_ESID_1S11)

/** \brief 160, Even Sync ID Symbol Window 13 */
#define ERAY1_ESID_1S12 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017160u)
/** Alias (User Manual Name) for ERAY1_ESID_1S12.
* To use register names with standard convension, please use ERAY1_ESID_1S12.
*/
#define ERAY1_ESID13 (ERAY1_ESID_1S12)

/** \brief 164, Even Sync ID Symbol Window 14 */
#define ERAY1_ESID_1S13 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017164u)
/** Alias (User Manual Name) for ERAY1_ESID_1S13.
* To use register names with standard convension, please use ERAY1_ESID_1S13.
*/
#define ERAY1_ESID14 (ERAY1_ESID_1S13)

/** \brief 168, Even Sync ID Symbol Window 15 */
#define ERAY1_ESID_1S14 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ESID*)0xF0017168u)
/** Alias (User Manual Name) for ERAY1_ESID_1S14.
* To use register names with standard convension, please use ERAY1_ESID_1S14.
*/
#define ERAY1_ESID15 (ERAY1_ESID_1S14)

/** \brief 170, Odd Sync ID Symbol Window 1 */
#define ERAY1_OSID_1S0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017170u)
/** Alias (User Manual Name) for ERAY1_OSID_1S0.
* To use register names with standard convension, please use ERAY1_OSID_1S0.
*/
#define ERAY1_OSID01 (ERAY1_OSID_1S0)

/** \brief 174, Odd Sync ID Symbol Window 2 */
#define ERAY1_OSID_1S1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017174u)
/** Alias (User Manual Name) for ERAY1_OSID_1S1.
* To use register names with standard convension, please use ERAY1_OSID_1S1.
*/
#define ERAY1_OSID02 (ERAY1_OSID_1S1)

/** \brief 178, Odd Sync ID Symbol Window 3 */
#define ERAY1_OSID_1S2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017178u)
/** Alias (User Manual Name) for ERAY1_OSID_1S2.
* To use register names with standard convension, please use ERAY1_OSID_1S2.
*/
#define ERAY1_OSID03 (ERAY1_OSID_1S2)

/** \brief 17C, Odd Sync ID Symbol Window 4 */
#define ERAY1_OSID_1S3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF001717Cu)
/** Alias (User Manual Name) for ERAY1_OSID_1S3.
* To use register names with standard convension, please use ERAY1_OSID_1S3.
*/
#define ERAY1_OSID04 (ERAY1_OSID_1S3)

/** \brief 180, Odd Sync ID Symbol Window 5 */
#define ERAY1_OSID_1S4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017180u)
/** Alias (User Manual Name) for ERAY1_OSID_1S4.
* To use register names with standard convension, please use ERAY1_OSID_1S4.
*/
#define ERAY1_OSID05 (ERAY1_OSID_1S4)

/** \brief 184, Odd Sync ID Symbol Window 6 */
#define ERAY1_OSID_1S5 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017184u)
/** Alias (User Manual Name) for ERAY1_OSID_1S5.
* To use register names with standard convension, please use ERAY1_OSID_1S5.
*/
#define ERAY1_OSID06 (ERAY1_OSID_1S5)

/** \brief 188, Odd Sync ID Symbol Window 7 */
#define ERAY1_OSID_1S6 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017188u)
/** Alias (User Manual Name) for ERAY1_OSID_1S6.
* To use register names with standard convension, please use ERAY1_OSID_1S6.
*/
#define ERAY1_OSID07 (ERAY1_OSID_1S6)

