Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEray_reg.h
/** \brief 664, Read Data Section 26 */
#define ERAY1_RDDS_1S25 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017664u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S25.
* To use register names with standard convension, please use ERAY1_RDDS_1S25.
*/
#define ERAY1_RDDS26 (ERAY1_RDDS_1S25)

/** \brief 668, Read Data Section 27 */
#define ERAY1_RDDS_1S26 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017668u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S26.
* To use register names with standard convension, please use ERAY1_RDDS_1S26.
*/
#define ERAY1_RDDS27 (ERAY1_RDDS_1S26)

/** \brief 66C, Read Data Section 28 */
#define ERAY1_RDDS_1S27 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001766Cu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S27.
* To use register names with standard convension, please use ERAY1_RDDS_1S27.
*/
#define ERAY1_RDDS28 (ERAY1_RDDS_1S27)

/** \brief 670, Read Data Section 29 */
#define ERAY1_RDDS_1S28 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017670u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S28.
* To use register names with standard convension, please use ERAY1_RDDS_1S28.
*/
#define ERAY1_RDDS29 (ERAY1_RDDS_1S28)

/** \brief 674, Read Data Section 30 */
#define ERAY1_RDDS_1S29 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017674u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S29.
* To use register names with standard convension, please use ERAY1_RDDS_1S29.
*/
#define ERAY1_RDDS30 (ERAY1_RDDS_1S29)

/** \brief 678, Read Data Section 31 */
#define ERAY1_RDDS_1S30 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017678u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S30.
* To use register names with standard convension, please use ERAY1_RDDS_1S30.
*/
#define ERAY1_RDDS31 (ERAY1_RDDS_1S30)

/** \brief 67C, Read Data Section 32 */
#define ERAY1_RDDS_1S31 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001767Cu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S31.
* To use register names with standard convension, please use ERAY1_RDDS_1S31.
*/
#define ERAY1_RDDS32 (ERAY1_RDDS_1S31)

/** \brief 680, Read Data Section 33 */
#define ERAY1_RDDS_1S32 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017680u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S32.
* To use register names with standard convension, please use ERAY1_RDDS_1S32.
*/
#define ERAY1_RDDS33 (ERAY1_RDDS_1S32)

/** \brief 684, Read Data Section 34 */
#define ERAY1_RDDS_1S33 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017684u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S33.
* To use register names with standard convension, please use ERAY1_RDDS_1S33.
*/
#define ERAY1_RDDS34 (ERAY1_RDDS_1S33)

/** \brief 688, Read Data Section 35 */
#define ERAY1_RDDS_1S34 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017688u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S34.
* To use register names with standard convension, please use ERAY1_RDDS_1S34.
*/
#define ERAY1_RDDS35 (ERAY1_RDDS_1S34)

/** \brief 68C, Read Data Section 36 */
#define ERAY1_RDDS_1S35 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001768Cu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S35.
* To use register names with standard convension, please use ERAY1_RDDS_1S35.
*/
#define ERAY1_RDDS36 (ERAY1_RDDS_1S35)

/** \brief 690, Read Data Section 37 */
#define ERAY1_RDDS_1S36 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017690u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S36.
* To use register names with standard convension, please use ERAY1_RDDS_1S36.
*/
#define ERAY1_RDDS37 (ERAY1_RDDS_1S36)

/** \brief 694, Read Data Section 38 */
#define ERAY1_RDDS_1S37 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017694u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S37.
* To use register names with standard convension, please use ERAY1_RDDS_1S37.
*/
#define ERAY1_RDDS38 (ERAY1_RDDS_1S37)

/** \brief 698, Read Data Section 39 */
#define ERAY1_RDDS_1S38 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF0017698u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S38.
* To use register names with standard convension, please use ERAY1_RDDS_1S38.
*/
#define ERAY1_RDDS39 (ERAY1_RDDS_1S38)

/** \brief 69C, Read Data Section 40 */
#define ERAY1_RDDS_1S39 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001769Cu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S39.
* To use register names with standard convension, please use ERAY1_RDDS_1S39.
*/
#define ERAY1_RDDS40 (ERAY1_RDDS_1S39)

/** \brief 6A0, Read Data Section 41 */
#define ERAY1_RDDS_1S40 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176A0u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S40.
* To use register names with standard convension, please use ERAY1_RDDS_1S40.
*/
#define ERAY1_RDDS41 (ERAY1_RDDS_1S40)

/** \brief 6A4, Read Data Section 42 */
#define ERAY1_RDDS_1S41 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176A4u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S41.
* To use register names with standard convension, please use ERAY1_RDDS_1S41.
*/
#define ERAY1_RDDS42 (ERAY1_RDDS_1S41)

/** \brief 6A8, Read Data Section 43 */
#define ERAY1_RDDS_1S42 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176A8u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S42.
* To use register names with standard convension, please use ERAY1_RDDS_1S42.
*/
#define ERAY1_RDDS43 (ERAY1_RDDS_1S42)

/** \brief 6AC, Read Data Section 44 */
#define ERAY1_RDDS_1S43 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176ACu)
/** Alias (User Manual Name) for ERAY1_RDDS_1S43.
* To use register names with standard convension, please use ERAY1_RDDS_1S43.
*/
#define ERAY1_RDDS44 (ERAY1_RDDS_1S43)

/** \brief 6B0, Read Data Section 45 */
#define ERAY1_RDDS_1S44 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176B0u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S44.
* To use register names with standard convension, please use ERAY1_RDDS_1S44.
*/
#define ERAY1_RDDS45 (ERAY1_RDDS_1S44)

/** \brief 6B4, Read Data Section 46 */
#define ERAY1_RDDS_1S45 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF00176B4u)
/** Alias (User Manual Name) for ERAY1_RDDS_1S45.
* To use register names with standard convension, please use ERAY1_RDDS_1S45.
*/
#define ERAY1_RDDS46 (ERAY1_RDDS_1S45)

